tutorials/incompressible/pUCoupledFoam/backwardFacingStepLaminar/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//     Up
//     {
//         solver BiCGStab;
//         preconditioner Cholesky;

//         tolerance 1e-07;
//         relTol  0.0;

//         minIter 1;
//         maxIter 1000;
//     }

    Up
    {
        solver          AMG;
        cycle           V-cycle;
        coarseningType  AAMG;
        norm            componentNorm;
        normComponent   0;

        nPreSweeps      2;
        nPostSweeps     2;
        groupSize       2;
        minCoarseEqns   4;
        nMaxLevels      100;
        scale           on;
        smoother
        {
            smoother        ILUCp;
            fillInLevel     1;
        }

        minIter         0;
        maxIter         100;
        tolerance       1e-7;
        relTol          0.0;
    }

    // Segregated
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0.01;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.1;
    }
}

blockSolver
{
    convergence 1e-6;
}

SIMPLE
{
    nNonOrthoCorrectors 0;
}

fieldBounds
{
    U      500;
    p      -5e4 5e4;
}

relaxationFactors
{
//     U    0.95;
}


// ************************************************************************* //
